CD2DTextFormat.#ctor(CRenderTarget*,ATL.CStringT&lt;System.Char,StrTraitMFC_DLL&lt;System.Char&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Single,DWRITE_FONT_WEIGHT,DWRITE_FONT_STYLE,DWRITE_FONT_STRETCH,ATL.CStringT&lt;System.Char,StrTraitMFC_DLL&lt;System.Char&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,IDWriteFontCollection*,System.Int32)
Constructs a CD2DTextFormat object.
pParentTarget: A pointer to the render target.
strFontFamilyName: A CString object that contains the name of the font family.
fontSize: The logical size of the font in DIP ("device-independent pixel") units. A DIPequals 1/96 inch.
fontWeight: A value that indicates the font weight for the text object.
fontStyle: A value that indicates the font style for the text object.
fontStretch: A value that indicates the font stretch for the text object.
strFontLocale: A CString object that contains the locale name.
pFontCollection: A pointer to a font collection object. When this is NULL, indicates the system font collection.
bAutoDestroy: Indicates that the object will be destroyed by owner (pParentTarget).